import React from 'react'
import Title from '../components/Title'
import { assets } from '../assets/assets'

const About = () => {
  return (
    <div>
      <div className='text-2xl text-center pt-8 border-t'>
        <Title text1={'ЗА'} text2={'SPEEDTECH'}/>
      </div>

      <div className='my-10 flex flex-col md:flex-row gap-16'>
        <img className='w-full md:max-w-[450px]' src={assets.about_img} alt="" />
        <div className='flex flex-col justify-center gap-6 md:w-2/4 text-gray-600'>
          <p>Добре дошли в SpeedTech – Вашият краен източник за високопроизводителни части за японски автомобили!</p>
          <p>В SpeedTech сме страстни по отношение на представянето, прецизността и преминаването на границите на японското автомобилно инженерство. Специализирани в Lexus, Toyota, Honda и Acura, ние предлагаме висококачествени тунинг части, подобрения и решения за автомобилни ентусиасти, които искат най-доброто от своите превозни средства.</p>
          <b className='text-gray-800'>Нашата мисия</b>
          <p>Нашата цел е проста: да предлагаме първокласни тунинг части, които подобряват мощността, управлението и цялостното изживяване при шофиране. Независимо дали изграждате писта, ежедневен звяр за улицата или автомобил, който да впечатлява на автошоу, ние сме тук с най-новите и най-добрите продукти в индустрията.</p>
        </div>
      </div>

      <div className='text-xl py-4'>
        <Title text1={'ЗАЩО'} text2={'SPEEDTECH'}/>
      </div>

      <div className='flex flex-col md:flex-row text-sm mb-20'>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Гарантирано качество:</b>
          <p className='text-gray-600'>В Speedtech Performance поставяме качеството на първо място чрез стриктно тестване на продуктите, сътрудничество с утвърдени производители и внимателно проследяване на клиентската обратна връзка, за да осигурим надеждни, издръжливи и високоефективни авточасти.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Удобство:</b>
          <p className='text-gray-600'>В Speedtech Performance се стремим към високо качество, удобство за клиента и отлично обслужване чрез стриктно тестване на продуктите, партньорства с доверени производители, активно събиране на обратна връзка и осигуряване на лесна поръчка и бърза доставка – всичко това с цел подобряване на представянето на вашия автомобил.</p>
        </div>
        <div className='border px-10 md:px-16 py-8 sm:py-20 flex flex-col gap-5'>
          <b>Изключително обслужване на клиенти:</b>
          <p className='text-gray-600'>В Speedtech Performance гарантираме качество, удобство и персонализирано обслужване чрез тестване на продуктите, работа с утвърдени доставчици, редовни одити, анализ на клиентски мнения и осигуряване на лесно поръчване, бърза доставка и индивидуална поддръжка – всичко за постигане на максимална ефективност на вашия автомобил.</p>
        </div>
      </div>
    </div>
  )
}

export default About